### Output
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```Terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurecaf_name.appinsights_name will be created
  + resource "azurecaf_name" "appinsights_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_application_insights"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.appserviceplan_name will be created
  + resource "azurecaf_name" "appserviceplan_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.functionapp_name will be created
  + resource "azurecaf_name" "functionapp_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "api",
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.keyvault_name will be created
  + resource "azurecaf_name" "keyvault_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_key_vault_key"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.loganalytics_name will be created
  + resource "azurecaf_name" "loganalytics_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.managedId_name will be created
  + resource "azurecaf_name" "managedId_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "general"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.rg_name will be created
  + resource "azurecaf_name" "rg_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.sqlserver_name will be created
  + resource "azurecaf_name" "sqlserver_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_sql_server"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.staticapp_name will be created
  + resource "azurecaf_name" "staticapp_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "static",
          + "dev",
        ]
      + use_slug      = true
    }

  # azurecaf_name.storageacc_name will be created
  + resource "azurecaf_name" "storageacc_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "pd-todo"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "dev",
        ]
      + use_slug      = true
    }

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = (known after apply)
      + resource_group_name                   = (known after apply)
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "azd-env-name" = "dev"
        }
      + workspace_id                          = (known after apply)
    }

  # azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy                 = [
          + {
              + key_permissions = [
                  + "Get",
                  + "List",
                ]
              + object_id       = "550e8400-e29b-41d4-a716-446655440000"
              + tenant_id       = "dbba3d9f-8b34-49b7-878a-d3d0d70056ce"
            },
        ]
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = (known after apply)
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "azd-env-name" = "dev"
        }
      + tenant_id                     = "dbba3d9f-8b34-49b7-878a-d3d0d70056ce"
      + vault_uri                     = (known after apply)
    }

  # azurerm_linux_function_app.functionapp will be created
  + resource "azurerm_linux_function_app" "functionapp" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = (known after apply)
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = (known after apply)
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "azd-env-name"     = "dev"
          + "azd-service-name" = "api"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # azurerm_log_analytics_workspace.loganalytics will be created
  + resource "azurerm_log_analytics_workspace" "loganalytics" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "uksouth"
      + name                               = (known after apply)
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = (known after apply)
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "azd-env-name" = "dev"
        }
      + workspace_id                       = (known after apply)
    }

  # azurerm_mssql_database.db will be created
  + resource "azurerm_mssql_database" "db" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "todo"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = (known after apply)
      + storage_account_type                = "Geo"
      + tags                                = {
          + "azd-env-name" = "dev"
        }
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = (known after apply)
    }

  # azurerm_mssql_server.sqlserver will be created
  + resource "azurerm_mssql_server" "sqlserver" {
      + administrator_login                  = "mradministrator"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "uksouth"
      + minimum_tls_version                  = "1.2"
      + name                                 = (known after apply)
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = (known after apply)
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "azd-env-name" = "dev"
        }
      + version                              = "12.0"
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = (known after apply)
      + tags     = {
          + "azd-env-name" = "dev"
        }
    }

  # azurerm_service_plan.appserviceplan will be created
  + resource "azurerm_service_plan" "appserviceplan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = (known after apply)
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = (known after apply)
      + sku_name                     = "Y1"
      + tags                         = {
          + "azd-env-name" = "dev"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_static_site.staticapp will be created
  + resource "azurerm_static_site" "staticapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "azd-env-name"     = "dev"
          + "azd-service-name" = "web"
        }
    }

  # azurerm_storage_account.functionapp_storage will be created
  + resource "azurerm_storage_account" "functionapp_storage" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = (known after apply)
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "azd-env-name" = "dev"
        }
    }

  # azurerm_user_assigned_identity.applicationIdentity will be created
  + resource "azurerm_user_assigned_identity" "applicationIdentity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = (known after apply)
      + tags                = {
          + "azd-env-name" = "dev"
        }
      + tenant_id           = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + APPLICATIONINSIGHTS_CONNECTION_STRING           = (known after apply)
  + AZURE_KEY_VAULT_ENDPOINT                        = (known after apply)
  + AZURE_KEY_VAULT_NAME                            = (known after apply)
  + AZURE_LOCATION                                  = "uksouth"
  + AZURE_TENANT_ID                                 = "dbba3d9f-8b34-49b7-878a-d3d0d70056ce"
  + REACT_APP_API_BASE_URL                          = (known after apply)
  + REACT_APP_APPLICATIONINSIGHTS_CONNECTION_STRING = (known after apply)
  + REACT_APP_WEB_BASE_URL                          = (known after apply)

```

</details>

*Pusher: @nigelhamer, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform plan`*